{
    "name" : "PvP Balance",

    "description" : "The mod provides a series of changes to make PvP games more balanced and interesting. Detailed documentation is available at: https://drive.google.com/file/d/1XC-J8Wd4A5WDpNgcjcUpg4oIlSXehCxU/view?usp=sharing",

    "author" : "wnukos (main author), Andruids (graphical assets and revision), Misiokles (revision), Dydzio (technical support)",

    "contact" : "wnukos on Discord",

    "modType" : "Expansion",
	
    "version" : "1.2.6",
 
    "changelog" :
    {
        "1.0"   : [ "initial release" ],
        "1.1"   : [ "Spells: slow effect fixed, Vampirism moved to water magic school, damage of Frost Ring and Fireball changed to 15 x SP, Fireball cost decreased at expert level.",
                    "Skills: Hexes unbanned, Intimidation reworked (-1 morale and 0/-1/-2 attack at basic/adv./expert lvl).",
                    "Heroes: Zam banned, Osir unbanned, Galuum - starts with Interference instead of Resistance, corrected starting armies for Shroo, Thyroc, Kreevion, Ghuri, Eurydis, Odetta, Verstan and Ash.",
	"Artifacts: class changed to Minor for artifacts giving rare resources, Head of Legion, Arms of Legion, Ring of Vitality and Pendant of Second Sight. Frog of Sagacity banned, Shield Wand temporarily banned due to incorrect effect of the artifact.",
	"Objects: Red Tower banned, new bank Demon Domain introduced, Golden Utopia buffed, guards of Experimental Shop changed back to Steel Golems, fixed Dragon Utopia generation on Dunes terrain, fixed generation of Sorceress Castle and re-balanced the object, unbanned Seminarium object, fixed generation of Ancient Lamps (zone limit increased to 20), Imp Cache value decreased to 1500, improved creature arrangement in Ruins object and slightly increased the reward.",
	"Creatures: Palladin nerfed (it casts Prayer at adv. level instead of mass Prayer), decreased Templar growth from 2 to 1. God Scales specialty of Anubis Warriors nerfed, Priestess and Forest Witch specialties nerfed. AI value of several units from Ruins Town, Heavenly Forge 2k, Pavilion Town and Tides of War adjusted.",
	"Added polish translation for the descriptions modified by PvP-Balance mod."],
        "1.2"   : [ "Demon Domain bank: decreased amount of Efreets obtained as reward from 6/9/12 to 5/8/10, corrected object mask.", "Small balancing changes for creatures." ],
        "1.2.1"   : [ "Added submod RMG which doubles value of t4 and t5 spell scrolls.", "Allowed crypt generation on Asphalt terrain."],
        "1.2.2"   : [ "Spint starting spell fixed - now he has Bless instead of Ice Bolt.", "Fixed graphics of View Earth and View Air spells.", "Shield Wand unbanned due to fixed mechanics of the artifact.", "AI value of Lizardmen and Lizard Warriors adjusted according to Hota 1.7 update.", "Summon Earth Elemental and Summon Fire Elemental adjusted according to HotA 1.7 update.", "Small corrections of mod structure."],
        "1.2.3"   : ["Temporarily banned Aura of Power spell due to broken mechanics.", "Unbanned Zam hero", "Fixed amount of summoned Fire and Earth Elementals at advanced level due to VCMI not accepting fractional values.", "Spells Vampirism, Intervention and Summon Ghost unlocked in mage guild.", "Gazebo object fixed.", "Build order in Ruins fixed - no Fort required for Mage Guild.", "Build order in Conflux fixed - upgrade of lvl1 dwelling requires only lvl1 horde building (same as in HotA)."],
        "1.2.4"   : [ "Do not spawn empty banks on maps with very high treasure values (100k+)" ],
        "1.2.5"   : [ "Temporarily banned Hokori hero due to broken mechanics of Aura of Power spell.", "Withdrew changes regarding Ruins Town build order due to update of the original town mod.", "Golden Utopia buffed - 2 Rust Dragons instead of 1.", "Modified specialty of Palladin creature - it casts now Destroy Undead at the beginning of the battle." ],
        "1.2.6"   : [ "Russian translation by Anton Sergeew" ]
    },

    "compatibility" :
    {
        "min" : "1.5.5"
    },
    
    "depends" : 
	[
		"hota",
		"forge2k",
		"ruins-town",
		"new-pavilion",
		"tides-of-war",
		"vcmi-extras",
		"zefix"
		
		
		
	],
    	 "conflicts" :
	[
	"h3-for-vcmi-englisation"
	],
    "polish" :
	{
		"name" : "PvP Balance",
		"description" : "Mod zawiera serię zmian, które mają na celu uczynić gry PvP ciekawszymi i bardziej zbalansowanymi.",	
		"translations" : [
			"translation/polish.json"
		]
	},
	"russian" :
	{
		"name" : "PvP Баланс",
		"description" : "Мод предоставляет ряд изменений, чтобы сделать PvP-игры более сбалансированными и интересными. Подробная документация доступна по адресу: https://drive.google.com/file/d/1XC-J8Wd4A5WDpNgcjcUpg4oIlSXehCxU/view?usp=sharing",	
		"translations" : [
			"translation/russian.json"
		]
	},
    "settings" : {
        "spells": {
            "dimensionDoorTournamentRulesLimit" : true
        }
    },
	
    "keepDisabled" : false
}
